src/cf/InformationRegisters/CRM_РабочееВремяПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_РабочееВремяПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудозатратыВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CRM_ИсточникТрудозатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_РабочееВремяПользователей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если CRM_ЛицензированиеСервер.ВариантПоставкиСТАРТ() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Функция доступна только для ""ПРОФ"" и ""КОРП"" поставки конфигурации!'");
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ДатаРегистрации) Тогда
		Запись.ДатаРегистрации = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		Запись.ДатаРабот = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		Запись.Пользователь = Пользователи.АвторизованныйПользователь();
		Запись.Подразделение = Запись.Пользователь.Подразделение;
		Если Параметры.Свойство("Источник") Тогда
			Запись.Источник = Параметры.Источник;
			ИсточникПриИзмененииНаСервере();
			//Элементы.ГруппаполнаяФорма.Видимость = Ложь;
			//Элементы.ГруппаКраткаяФорма.Видимость = Истина;
			Элементы.ФормаКомандаСтарт.Видимость = Истина;
			Элементы.ФормаКоммандаСтоп.Видимость = Истина;
			//Элементы.КомандаПоказатьСкрытьДопРеквизиты.Видимость = Истина;
			//Элементы.ГруппаДопРеквизиты.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	Элементы.ФормаКоммандаСтоп.Доступность = Ложь;
	ТрудозатратыВремя = ТрудозатратыВремя + Запись.Трудозатраты;
	
	Если (Запись.Пользователь <> Пользователи.АвторизованныйПользователь()) И (НЕ РольДоступна("ПолныеПрава")) И (НЕ Запись.Пользователь.Подразделение.ТекущийРуководитель = Пользователи.АвторизованныйПользователь()) Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ФормаКомандаСтарт.Видимость = Ложь;
		Элементы.ФормаКоммандаСтоп.Видимость = Ложь;
		Элементы.ТрудозатратыВремя.Доступность = Ложь;
		Элементы.Клиент.Доступность = Ложь;
		Элементы.Этап.Доступность = Ложь;
		Элементы.Проект.Доступность = Ложь;
		Элементы.ОписаниеРабот.Доступность = Ложь;
		Элементы.ВидРабот.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ИсточникПриИзмененииНаСервере()
	Если ТипЗнч(Запись.Источник) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если ЗначениеЗаполнено(Запись.Источник.БизнесПроцесс) Тогда
			Запись.КартаМаршрута = Запись.Источник.БизнесПроцесс.КартаМаршрута;
			Запись.ТочкаМаршрута = Запись.Источник.CRM_ТочкаМаршрута;
		КонецЕсли;	
		Запись.Клиент = Запись.Источник.CRM_Партнер;
		Запись.Проект = Запись.Источник.CRM_Проект;
		Запись.Этап = Запись.Источник.CRM_Этап;
	ИначеЕсли ТипЗнч(Запись.Источник) = Тип("ДокументСсылка.CRM_Интерес") Тогда	
		Запись.Клиент = Запись.Источник.Партнер;
	ИначеЕсли ТипЗнч(Запись.Источник) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если ТипЗнч(Запись.Источник.АбонентКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
			Запись.Клиент = Запись.Источник.АбонентКонтакт;	
		ИначеЕсли ТипЗнч(Запись.Источник.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
			Запись.Клиент = Запись.Источник.АбонентКонтакт.Владелец;	
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Запись.Источник) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Если ТипЗнч(Запись.Источник.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
			Запись.Клиент = Запись.Источник.ОтправительКонтакт;	
		ИначеЕсли ТипЗнч(Запись.Источник.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
			Запись.Клиент = Запись.Источник.ОтправительКонтакт.Владелец;	
		КонецЕсли;	
		Запись.Проект = Запись.Источник.CRM_Проект;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.Клиент) И CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Партнер", Запись.Источник.Метаданные()) Тогда
		Запись.Клиент = Запись.Источник["Партнер"];
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.Проект) И CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Проект", Запись.Источник.Метаданные()) Тогда
		Запись.Проект = Запись.Источник["Проект"];
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.Проект) И CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("CRM_Проект", Запись.Источник.Метаданные()) Тогда
		Запись.Проект = Запись.Источник["CRM_Проект"];
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ИсточникПриИзменении(Элемент)
//	ИсточникПриИзмененииНаСервере();
//КонецПроцедуры

&НаКлиенте
Процедура КомандаСтарт(Команда)
	ВремяСтарта = ТекущаяДата();
	Элементы.ФормаКоммандаСтоп.Доступность = Истина;
	Элементы.ФормаКомандаСтарт.Доступность = Ложь;
	Элементы.ТрудозатратыВремя.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КоммандаСтоп(Команда)
	Запись.Трудозатраты = Запись.Трудозатраты + (ТекущаяДата() - ВремяСтарта);
	ТрудозатратыВремя = Дата('00010101') + Запись.Трудозатраты;
	Элементы.ФормаКоммандаСтоп.Доступность = Ложь;
	Элементы.ФормаКомандаСтарт.Доступность = Истина;
	Элементы.ТрудозатратыВремя.Доступность = Истина;
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ТрудозатратыВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияВыбранногоВремени", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтотОбъект, ТрудозатратыВремя, Элемент,,Истина, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияВыбранногоВремени(ВыбранноеВремя, Дополнительно) Экспорт
	Если ВыбранноеВремя <> Неопределено Тогда
		ТрудозатратыВремя = ВыбранноеВремя.Значение;     
		Запись.Трудозатраты = ТрудозатратыВремя - Дата('00010101');
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТрудозатратыВремяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Запись.Трудозатраты = ТрудозатратыВремя - Дата('00010101');
КонецПроцедуры


&НаКлиенте
Процедура КомандаОткрытьСписокПоОбъекту(Команда)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Источник", Запись.Источник);
	ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("РегистрСведений.CRM_РабочееВремяПользователей.ФормаСписка", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно, ,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.ТрудозатратыВремя = Дата('00010101') + Запись.Трудозатраты;
КонецПроцедуры


&НаКлиенте
Процедура ТрудозатратыВремяПриИзменении(Элемент)
	Запись.Трудозатраты = ТрудозатратыВремя - Дата('00010101');
КонецПроцедуры
